

MORSE_DICT = {      'А':'.-', 'Б':'-...', 'В':'.--',
                    'Г':'--.', 'Д':'-..', 'Е':'.', 
                    'Ж':'...-', 'З':'--..', 'И':'..',
                    'Й':'.---', 'К':'-.-', 'Л':'.-..',
                    'М':'--', 'Н':'-.', 'О':'---',
                    'П':'.--.', 'Р':'.-.', 'С':'...',
                    'Т':'-', 'У':'..-', 'Ф':'..-.', 
                    'Х':'....', 'Ц':'-.-.', 'Ч':'---.',
                    'Ш':'----', 'Щ':'--.-', 'Ъ':'.--.-.',
                    'Ы':'-.--', 'Ь':'-..-', 'Э':'...-...',
                    'Ю':'..--', 'Я':'.-.-'        }

shifr_start = input()
shifr = shifr_start.replace('/', '') #тк новое слово - это ' / ', а просто два пробела не идентифицируют ничего
#то можно, убрав '/' все равно распознавать, когда начнется новое слово, просто запустив счетчик пробелов i

def decrypt(shifr):

    translate = ''
    code_of_char = ''
    
    for symb in shifr:
        if symb != ' ':
            i = 0
            code_of_char += symb
 
        elif symb == 'E':
            break
            
        else:
            i += 1 #если i=1 --> новая буква 

            if i == 2 : # i=2 --> новое слово, т.е в расшифровку нужно вставить пробел
                translate += ' '
            else:

                translate += list(MORSE_DICT.keys())[list(MORSE_DICT.values()).index(code_of_char)]
                code_of_char = ''
 
    return translate
 
 
print (decrypt(shifr))
 
